[
    {
        "job_title": "Embedded C++ developer",
        "company_name": "ZF",
        "job_description": [
            "Experience in: C++ (min 3 years) Development of Embedded applications on any layers above BSP/FW.",
            "Responsible for successfully design, development and delivery…"
        ]
    },
    {
        "job_title": "Software Engineer (C, C++)",
        "company_name": "NetApp",
        "job_description": [
            "As a software engineer you will work as part of an exceptionally talented engineering team responsible for driving product development and strategy."
        ]
    },
    {
        "job_title": "C++ Developer",
        "company_name": "It Resource Hunter",
        "job_description": [
            "3-6 years of industry experience in related technologies.",
            "Proficiency in modern software engineering practices including agile methodologies, coding standards,…"
        ]
    },
    {
        "job_title": "Lead Engineer - Full Stack - Java/React",
        "company_name": "Telstra",
        "job_description": [
            "10+ years of Hands-on experience in coding and application development, delivering solutions to meet customer needs and adhering to coding, quality and design…"
        ]
    },
    {
        "job_title": "Software Engineer- C++",
        "company_name": "Informatica",
        "job_description": [
            "Excellent coding and design skills in server-side technologies, object-oriented concepts, multithreading and STL are mandatory."
        ]
    },
    {
        "job_title": "Software Engineer, AVP",
        "company_name": "NatWest Digital X",
        "job_description": [
            "Software Engineering, Technology Software Engineer, AVP Bangalore, India Permanent Full Time #R…"
        ]
    },
    {
        "job_title": "Staff Software Engineer",
        "company_name": "Intuit",
        "job_description": [
            "Demonstrated ability to work with global teams across time zones.",
            "Works with PM on identifying and measuring business goals in product usage."
        ]
    },
    {
        "job_title": "Senior C/C++ developer",
        "company_name": "Qatapultt Learning Solutions Pvt Ltd",
        "job_description": [
            "C and C++ development experience is a must with at least 3-4 recent experience.*.",
            "Experience with using Git and working as part of a larger team."
        ]
    },
    {
        "job_title": "Full Stack Engineer",
        "company_name": "Accenture",
        "job_description": [
            "Roles & Responsibilities: - Lead the development and configuration of software systems using Advanced Embedded System Engineering expertise."
        ]
    },
    {
        "job_title": "Java Developer",
        "company_name": "Techjet.ai",
        "job_description": [
            "Contract Duration : 3-6 Months.",
            "Experience writing code using TDD.",
            "At least 3 years of experience working on an API for mobile app or web products."
        ]
    },
    {
        "job_title": "Software Engineer - Product Integration",
        "company_name": "Lenovo",
        "job_description": [
            "Proficient in using Configuration management tools like Gerrit/Git and Change request tracking tools like JIRA.",
            "Excellent analytical and problem-solving skills."
        ]
    },
    {
        "job_title": "Software Engineer",
        "company_name": "Clario",
        "job_description": [
            "Strong verbal and written communication skills with excellent presentation skills; ability to lead design to lead design sessions and user test sessions."
        ]
    }
]